#### Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-07T03:17:57Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base

Group 3
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps



Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.spot_kubeconfig.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "spot_kubeconfig" "this" {
      + cloudspace_name = "mp-runners-v3"
      + id              = (known after apply)
      + kubeconfigs     = (known after apply)
      + raw             = (known after apply)
    }

  # spot_cloudspace.this will be created
  + resource "spot_cloudspace" "this" {
      + bids                  = (known after apply)
      + cloudspace_name       = "mp-runners-v3"
      + cni                   = "calico"
      + deployment_type       = "gen2"
      + first_ready_timestamp = (known after apply)
      + hacontrol_plane       = false
      + id                    = (known after apply)
      + kubernetes_version    = "1.31.1"
      + last_updated          = (known after apply)
      + name                  = (known after apply)
      + pending_allocations   = (known after apply)
      + region                = "us-central-dfw-1"
      + spotnodepool_ids      = (known after apply)
      + wait_until_ready      = true
    }

  # spot_spotnodepool.this will be created
  + resource "spot_spotnodepool" "this" {
      + autoscaling          = {
          + max_nodes = 15
          + min_nodes = 2
        }
      + bid_price            = 0.28
      + bid_status           = (known after apply)
      + cloudspace_name      = "mp-runners-v3"
      + desired_server_count = (known after apply)
      + id                   = (known after apply)
      + last_updated         = (known after apply)
      + name                 = (known after apply)
      + server_class         = "gp.vs1.large-dfw"
      + won_count            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudspace_name        = "mp-runners-v3"
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (known after apply)
  + cluster_token          = (sensitive value)
  + kubeconfig_raw         = (sensitive value)
  + node_scaling           = {
      + max = 15
      + min = 2
    }
  + nodepool_id            = (known after apply)
  + region                 = "us-central-dfw-1"
  + server_class           = "gp.vs1.large-dfw"

Warning: Deprecated attribute

  on outputs.tf line 15, in output "nodepool_id":
  15:   value       = spot_spotnodepool.this.id

The attribute "id" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/spot...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

Error: Failed to query available provider packages

Could not retrieve the list of available versions for provider
hashicorp/spot: provider registry registry.opentofu.org does not have a
provider named registry.opentofu.org/hashicorp/spot

All modules should specify their required_providers so that external
consumers will get the correct providers when using a module. To see which
modules are currently depending on hashicorp/spot, run the following command:
    tofu providers

If you believe this provider is missing from the registry, please submit a
issue on the OpenTofu Registry
https://github.com/opentofu/registry/issues/new/choose

time=2026-01-07T03:18:10Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T03:18:10Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base has finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T03:18:10Z level=error msg=Dependency /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base of module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps just finished with an error. Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps will have to return an error too. prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps] 
time=2026-01-07T03:18:10Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps has finished with an error: Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace, /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps] 
time=2026-01-07T03:18:10Z level=info msg=
Error: Failed to query available provider packages

Could not retrieve the list of available versions for provider
hashicorp/spot: provider registry registry.opentofu.org does not have a
provider named registry.opentofu.org/hashicorp/spot

All modules should specify their required_providers so that external
consumers will get the correct providers when using a module. To see which
modules are currently depending on hashicorp/spot, run the following command:
    tofu providers

If you believe this provider is missing from the registry, please submit a
issue on the OpenTofu Registry
https://github.com/opentofu/registry/issues/new/choose

time=2026-01-07T03:18:10Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 

time=2026-01-07T03:18:10Z level=error msg=2 errors occurred:
	* Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace, /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1


	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base/.terragrunt-cache/j_ewW1cphwAkbyDEbd2Mtth3zaQ/N31IknbE-0V_f0_7CNz9jzIrj6A] exit status 1


```
</details>